package com.javarush.test.level02.lesson02.task06;

/* Сумма и произведение
В методе main обьявите две целочисельные переменные a и b типа int. Присвойте им любые значения.
Выведите на экран их сумму и произведение. Каждое значение выводить с новой строки.
Пример вывода на экран для а = 5, b = 7:
12
35
*/
public class Solution {
	public static void main(String[] args) {
		int a = 5;
		int b = 7;
		System.out.println(a + b);
		System.out.println(a * b);
	}
}
